## SQLite и Pandas

In [1]:
import sqlite3
import pandas as pd

In [2]:
# Создаем коннектор к файлу нашей базы данных. 
# Само собой, файлик Базы Данных должен лежать рядом с файлом блокнота (который вы сейчас читаете). 
con = sqlite3.connect('DBname_new.db')

In [3]:
# Не спрашивайте
cur = con.cursor()

1. Выводим все данные из созданной и заполненой таблицы EmployeePoints

In [4]:
cur.execute('SELECT * FROM EmployeePoints').fetchall()

[('Маша', 5, '2020-01-01'),
 ('Петя', 4, '2020-01-01'),
 ('Вася', 3, '2020-01-01'),
 ('Саша', 4, '2020-01-01'),
 ('Маша', 4, '2020-01-02'),
 ('Петя', 4, '2020-01-02'),
 ('Вася', 4, '2020-01-02'),
 ('Саша', 5, '2020-01-02'),
 ('Маша', 5, '2020-01-03'),
 ('Петя', 3, '2020-01-03'),
 ('Вася', 2, '2020-01-03'),
 ('Саша', 3, '2020-01-03'),
 ('Маша', 3, '2020-01-04'),
 ('Петя', 3, '2020-01-04'),
 ('Вася', 3, '2020-01-04'),
 ('Саша', 3, '2020-01-04'),
 ('Максим', 2, '2020-01-04'),
 ('Маша', 5, '2020-01-05'),
 ('Петя', 3, '2020-01-05'),
 ('Вася', 3, '2020-01-05'),
 ('Саша', 3, '2020-01-05')]

# Pandas

2. SELECT, который выводит список уникальных имен сотрудников.

In [5]:
df = pd.read_sql("""

    SELECT DISTINCT Employee
FROM EmployeePoints

""", con)
df

  Employee
0     Маша
1     Петя
2     Вася
3     Саша
4   Максим

3. SELECT, который выводит список сотрудников, упорядоченный по количеству полученных оценок "5", начиная с сотрудника, который получил их максимальное количество.

In [6]:
df1 = pd.read_sql("""

    SELECT Employee, count(Point)
FROM EmployeePoints
WHERE Point=5
GROUP BY Employee 

""", con)
df1

  Employee  count(Point)
0     Маша             3
1     Саша             1